<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class IbScopeDetailsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('ib_scope_details')->insert([
            [
                'ib_scope_topic_id' => 1,
                'name' => 'ผลิตภัณฑ์เหล็ก'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'วัสดุก่อสร้าง คอนกรีต สุขภัณฑ์ เซรามิก เครื่องเรือน'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'บริภัณฑ์ส่องสว่าง'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'ไฟฟ้ากำลัง'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'เครื่องใช้ไฟฟ้า'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'เครื่องใช้อิเล็กทรอนิกส์'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'โภคภัณฑ์ ของเล่น'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'ยาง เคมี สิ่งทอ ปิโตรเลียม อาหาร'  
            ],
            [
                'ib_scope_topic_id' => 1,
                'name' => 'ยานยนต์และชิ้นส่วนยานยนต์ เครื่องกล'  
            ],
            [
                'ib_scope_topic_id' => 2,
                'name' => 'ลักษณะทั่วไป'  
            ],
            [
                'ib_scope_topic_id' => 2,
                'name' => 'รูปแบบและขนาด'  
            ],
            [
                'ib_scope_topic_id' => 2,
                'name' => 'ปริมาณและการบรรจุ (เฉพาะการตรวจก่อนการส่งมอบ)'  
            ],
            [
                'ib_scope_topic_id' => 3,
                'name' => 'ลักษณะทั่วไป,รูปแบบ สี และขนาด,ตรวจโลหะ,ปริมาณและการบรรจุ (เฉพาะก่อนการส่งมอบ)'  
            ],
            [
                'ib_scope_topic_id' => 4,
                'name' => 'สําหรับกลุ่มผลิตภัณฑ์อาหารแช่แข็ง,กลุ่มผลิตภัณฑ์อาหารกระป๋อง'  
            ],
            [
                'ib_scope_topic_id' => 5,
                'name' => 'จํานวน'  
            ],
            [
                'ib_scope_topic_id' => 5,
                'name' => 'สภาพความสมบูรณ์ภายนอกของรถยนต์ เช่น สภาพของกระจก สภาพทั่วไปของตัวถัง สภาพยางและล้อ ความสะอาด และอื่น ๆ ที่อยู่ภายนอก'  
            ],
            [
                'ib_scope_topic_id' => 6,
                'name' => 'การตรวจชิ้นส่วนประกอบการผลิตถัง'  
            ],
            [
                'ib_scope_topic_id' => 6,
                'name' => 'การตรวจระหว่างการประกอบ'  
            ],
            [
                'ib_scope_topic_id' => 6,
                'name' => 'การทํากระบวนการทางความร้อน'  
            ],
            [
                'ib_scope_topic_id' => 6,
                'name' => 'การทดสอบทั้งทางกล การรั่ว การขยายตัวและการระเบิด และการตรวจสอบปริมาตร'  
            ],
            [
                'ib_scope_topic_id' => 6,
                'name' => 'การตรวจสอบก่อนการส่งมอบ'  
            ],
            [
                'ib_scope_topic_id' => 7,
                'name' => 'ปริมาณ,คุณภาพทางกายภาพและลักษณะทั่วไป ดังต่อไปนี้,ประเภท ชนิด,ความบริสุทธิ์,ความชื้น,ขนาดของเมล็ดข้าว,ส่วนผสม (ข้าวเต็มเมล็ด ข้าวหัก ต้นข้าว),ข้าวและสิ่งที่อาจมีปนได้ (เมล็ดเสีย เมล็ดเหลือง เมล็ดท้องไข่ เมล็ดแดง ฯลฯ),ไม่มีแมลงที่ยังมีชีวิต,ระดับการขัดสี,ไม่ครอบคลุมการตรวจความบริสุทธิ์ด้วยวิธีวิเคราะห์ในห้องปฏิบัติการในรายการปริมาณอมิโลส (Amylose content) และค่าการสลายเมล็ดข้าวในด่าง (Alkali spreading value)'  
            ],
            [
                'ib_scope_topic_id' => 8,
                'name' => 'ปริมาณ,คุณภาพทางกายภาพและลักษณะทั่วไป,ประเภท ชนิด,พื้นข้าว (ยกเว้นข้าวเหนียวขาว),ความชื้น,ขนาดของเมล็ดข้าว,ส่วนผสม (ข้าวเต็มเมล็ด ข้าวหัก ต้นข้าว),ข้าวและสิ่งที่อาจมีปนได้ (เมล็ดเสีย เมล็ดเหลือง เมล็ดท้องไข่ เมล็ดแดง ฯลฯ),ไม่มีแมลงที่ยังมีชีวิต,ระดับการขัดสี (ยกเว้นข้าวกล้อง)'  
            ],

        ]);
    }
}
